mixed_text = """Isaac Asimov
Айзек Азимов
The Last Question
Последний вопрос
The last question was asked for the first time, half in jest, on May 21, 2061, at a time when humanity first stepped into the light.
Впервые последний вопрос был задан наполовину в шутку 21 мая 2061 года, когда человечество вступило в Новую Эру, полностью овладев энергией своего светила.
The question came about as a result of a five-dollar bet over highballs, and it happened this way:
Вопрос возник в результате пятидолларового пари, заключенного между коктейлями.
Дело обстояло так.
Alexander Adell and Bertram Lupov were two of the faithful attendants of Multivac.
Александр Аделл и Бертран Лупов входили в свиту Мультивака и были его верными и преданными слугами.
As well as any human beings could, they knew what lay behind the cold, clicking, flashing face—miles and miles of face—of that giant computer.
Они знали (насколько может знать человек), что скрывается за холодным, мерцающим ликом этого гигантского компьютера, ликом, протянувшимся целые мили.
They had at least a vague notion of the general plan of relays and circuits that had long since grown past the point where any single human could possibly have a firm grasp of the whole.
Они имели по крайней мере туманное представление об общем плане всех этих целей и реле, образующих сооружение настолько сложное, что даже уже минули времена, когда один человек мог держать в голове его целостный образ.
Multivac was self-adjusting and self-correcting.



Мультивак был машиной самоорганизующейся и самообучающейся.
It had to be, for nothing human could adjust and correct it quickly enough or even adequately enough.—So Adell and Lupov attended the monstrous giant only lightly and superficially, yet as well as any men could.
Так и должно быть, ибо не существует человека, который смог бы обучать и организовывать его с надлежащей точностью и быстротой.
Так что к мыслительным процессам Мультивака Лупов и Аделл имели отношение весьма косвенное.
Но то, что им поручено было делать, они выполняли со рвением.
They fed it data, adjusted questions to its needs and translated the answers that were issued.
Они скармливали Мультиваку информацию, приспосабливали данные и вопросы к его внутреннему языку и расшифровывали выдаваемые ответы.
Certainly they, and all others like them, were fully entitled to share in the glory that was Multivac’s.
Определенно, они (как и многие другие их коллеги) имели полное право на отблеск сияющего ореола славы Мультивака.
For decades, Multivac had helped design the ships and plot the trajectories that enabled man to reach the Moon, Mars, and Venus, but past that, Earth’s poor resources could not support the ships.
Десятилетиями Мультивак помогал людям конструировать ракеты и рассчитывать траектории, по которым человечество смогло достичь Луны, Марса и Венеры.
Но затем Земля истощила свои ресурсы и не могла уже позволить себе роскошь космических перелетов.
Too much energy was needed for the long trips.sdsdfdf ffdfывыв dffdf ввааав dsdsddsdsф ававdsd 988989assыфы вывыв95895dsds
Earth exploited its coal and uranium with increasing efficiency, but there was only so much of both.
Для длительных перелетов нужно было много энергии, и хотя Земля научилась тратить свой уголь и свой уран с большой эффективностью, запасы и того и другого были ограничены и весьма скромны.
But slowly Multivac learned enough to answer deeper questions more fundamentally, and on May 14, 2061, what had been theory, became fact.
Совершенствуясь в процессе самообучения, Мультивак смог наконец найти решение этой задачи и удовлетворить фундаментальную потребность человечества в энергии.
21 мая 2061 года то, что считалось до этого теорией, стало свершившимся фактом.
The energy of the sun was stored, converted, and utilized directly on a planet-wide scale.
Земля научилась запасать, транспортировать и использовать прямую солнечную энергию во всепланетном масштабе.

sdsdfdf ffdfывыв dffdf ввааав dsdsddsdsф ававdsd 988989assыфы вывыв95895dsds"""

word_amount_in_mixed_text = 615
paragraph_amount_in_mixed_text = 37
bilingual_word_amount_in_mixed_text = 10
number_of_each_letters_in_mixed_text = {'а': 135, 'б': 25, 'в': 108, 'г': 40, 'д': 38, 'е': 156, 'ё': 0, 'ж': 11,
                                        'з': 23, 'и': 133, 'й': 21, 'к': 52, 'л': 107, 'м': 71, 'н': 100, 'о': 201,
                                        'п': 41, 'р': 78, 'с': 94, 'т': 105, 'у': 53, 'ф': 10, 'х': 9, 'ц': 8, 'ч': 29,
                                        'ш': 12, 'щ': 9, 'ъ': 0, 'ы': 51, 'ь': 43, 'э': 10, 'ю': 17, 'я': 25, 'a': 133,
                                        'b': 15, 'c': 43, 'd': 94, 'e': 157, 'f': 49, 'g': 26, 'h': 74, 'i': 75, 'j': 5,
                                        'k': 5, 'l': 79, 'm': 32, 'n': 94, 'o': 84, 'p': 25, 'q': 7, 'r': 60, 's': 108,
                                        't': 135, 'u': 52, 'v': 15, 'w': 25, 'x': 2, 'y': 31, 'z': 1}

words_from_mixed_text = [
    'isaac', 'asimov', 'айзек', 'азимов', 'the', 'last', 'question', 'последний', 'вопрос', 'the', 'last', 'question',
    'was', 'asked', 'for', 'the', 'first', 'time', 'half', 'in', 'jest', 'on', 'may', '21', '2061', 'at', 'a', 'time',
    'when', 'humanity', 'first', 'stepped', 'into', 'the', 'light', 'впервые', 'последний', 'вопрос', 'был', 'задан',
    'наполовину', 'в', 'шутку', '21', 'мая', '2061', 'года', 'когда', 'человечество', 'вступило', 'в', 'новую', 'эру',
    'полностью', 'овладев', 'энергией', 'своего', 'светила', 'the', 'question', 'came', 'about', 'as', 'a', 'result',
    'of', 'a', 'five', 'dollar', 'bet', 'over', 'highballs', 'and', 'it', 'happened', 'this', 'way', 'вопрос', 'возник',
    'в', 'результате', 'пятидолларового', 'пари', 'заключенного', 'между', 'коктейлями', 'дело', 'обстояло', 'так',
    'alexander', 'adell', 'and', 'bertram', 'lupov', 'were', 'two', 'of', 'the', 'faithful', 'attendants', 'of',
    'multivac', 'александр', 'аделл', 'и', 'бертран', 'лупов', 'входили', 'в', 'свиту', 'мультивака', 'и', 'были',
    'его', 'верными', 'и', 'преданными', 'слугами', 'as', 'well', 'as', 'any', 'human', 'beings', 'could', 'they',
    'knew', 'what', 'lay', 'behind', 'the', 'cold', 'clicking', 'flashing', 'face', 'miles', 'and', 'miles', 'of',
    'face', 'of', 'that', 'giant', 'computer', 'они', 'знали', 'насколько', 'может', 'знать', 'человек', 'что',
    'скрывается', 'за', 'холодным', 'мерцающим', 'ликом', 'этого', 'гигантского', 'компьютера', 'ликом',
    'протянувшимся', 'целые', 'мили', 'they', 'had', 'at', 'least', 'a', 'vague', 'notion', 'of', 'the', 'general',
    'plan', 'of', 'relays', 'and', 'circuits', 'that', 'had', 'long', 'since', 'grown', 'past', 'the', 'point',
    'where', 'any', 'single', 'human', 'could', 'possibly', 'have', 'a', 'firm', 'grasp', 'of', 'the', 'whole', 'они',
    'имели', 'по', 'крайней', 'мере', 'туманное', 'представление', 'об', 'общем', 'плане', 'всех', 'этих', 'целей',
    'и', 'реле', 'образующих', 'сооружение', 'настолько', 'сложное', 'что', 'даже', 'уже', 'минули', 'времена', 'когда',
    'один', 'человек', 'мог', 'держать', 'в', 'голове', 'его', 'целостный', 'образ', 'multivac', 'was', 'self',
    'adjusting', 'and', 'self', 'correcting', 'мультивак', 'был', 'машиной', 'самоорганизующейся', 'и',
    'самообучающейся', 'it', 'had', 'to', 'be', 'for', 'nothing', 'human', 'could', 'adjust', 'and', 'correct', 'it',
    'quickly', 'enough', 'or', 'even', 'adequately', 'enough', 'so', 'adell', 'and', 'lupov', 'attended', 'the',
    'monstrous', 'giant', 'only', 'lightly', 'and', 'superficially', 'yet', 'as', 'well', 'as', 'any', 'men', 'could',
    'так', 'и', 'должно', 'быть', 'ибо', 'не', 'существует', 'человека', 'который', 'смог', 'бы', 'обучать', 'и',
    'организовывать', 'его', 'с', 'надлежащей', 'точностью', 'и', 'быстротой', 'так', 'что', 'к', 'мыслительным',
    'процессам', 'мультивака', 'лупов', 'и', 'аделл', 'имели', 'отношение', 'весьма', 'косвенное', 'но', 'то', 'что',
    'им', 'поручено', 'было', 'делать', 'они', 'выполняли', 'со', 'рвением', 'they', 'fed', 'it', 'data', 'adjusted',
    'questions', 'to', 'its', 'needs', 'and', 'translated', 'the', 'answers', 'that', 'were', 'issued', 'они',
    'скармливали', 'мультиваку', 'информацию', 'приспосабливали', 'данные', 'и', 'вопросы', 'к', 'его', 'внутреннему',
    'языку', 'и', 'расшифровывали', 'выдаваемые', 'ответы', 'certainly', 'they', 'and', 'all', 'others', 'like', 'them',
    'were', 'fully', 'entitled', 'to', 'share', 'in', 'the', 'glory', 'that', 'was', 'multivac', 's', 'определенно',
    'они', 'как', 'и', 'многие', 'другие', 'их', 'коллеги', 'имели', 'полное', 'право', 'на', 'отблеск', 'сияющего',
    'ореола', 'славы', 'мультивака', 'for', 'decades', 'multivac', 'had', 'helped', 'design', 'the', 'ships', 'and',
    'plot', 'the', 'trajectories', 'that', 'enabled', 'man', 'to', 'reach', 'the', 'moon', 'mars', 'and', 'venus', 'but',
    'past', 'that', 'earth', 's', 'poor', 'resources', 'could', 'not', 'support', 'the', 'ships', 'десятилетиями',
    'мультивак', 'помогал', 'людям', 'конструировать', 'ракеты', 'и', 'рассчитывать', 'траектории', 'по', 'которым',
    'человечество', 'смогло', 'достичь', 'луны', 'марса', 'и', 'венеры', 'но', 'затем', 'земля', 'истощила', 'свои',
    'ресурсы', 'и', 'не', 'могла', 'уже', 'позволить', 'себе', 'роскошь', 'космических', 'перелетов', 'too', 'much',
    'energy', 'was', 'needed', 'for', 'the', 'long', 'trips', 'sdsdfdf', 'ffdfывыв', 'dffdf', 'ввааав', 'dsdsddsdsф',
    'ававdsd', '988989assыфы', 'вывыв95895dsds', 'earth', 'exploited', 'its', 'coal', 'and', 'uranium', 'with',
    'increasing', 'efficiency', 'but', 'there', 'was', 'only', 'so', 'much', 'of', 'both', 'для', 'длительных',
    'перелетов', 'нужно', 'было', 'много', 'энергии', 'и', 'хотя', 'земля', 'научилась', 'тратить', 'свой', 'уголь',
    'и', 'свой', 'уран', 'с', 'большой', 'эффективностью', 'запасы', 'и', 'того', 'и', 'другого', 'были', 'ограничены',
    'и', 'весьма', 'скромны', 'but', 'slowly', 'multivac', 'learned', 'enough', 'to', 'answer', 'deeper', 'questions',
    'more', 'fundamentally', 'and', 'on', 'may', '14', '2061', 'what', 'had', 'been', 'theory', 'became', 'fact',
    'совершенствуясь', 'в', 'процессе', 'самообучения', 'мультивак', 'смог', 'наконец', 'найти', 'решение', 'этой',
    'задачи', 'и', 'удовлетворить', 'фундаментальную', 'потребность', 'человечества', 'в', 'энергии', '21', 'мая',
    '2061', 'года', 'то', 'что', 'считалось', 'до', 'этого', 'теорией', 'стало', 'свершившимся', 'фактом', 'the',
    'energy', 'of', 'the', 'sun', 'was', 'stored', 'converted', 'and', 'utilized', 'directly', 'on', 'a', 'planet',
    'wide', 'scale', 'земля', 'научилась', 'запасать', 'транспортировать', 'и', 'использовать', 'прямую', 'солнечную',
    'энергию', 'во', 'всепланетном', 'масштабе', 'sdsdfdf', 'ffdfывыв', 'dffdf', 'ввааав', 'dsdsddsdsф', 'ававdsd',
    '988989assыфы', 'вывыв95895dsds'
]
statistics_for_letter_from_mixed_text = {'а': (0.04165381055229867, 105), 'б': (0.007713668620796051, 25),
                                                 'в': (0.03332304844183894, 85),
                                                 'г': (0.012341869793273681, 37), 'д': (0.011724776303609998, 38),
                                                 'е': (0.04813329219376736, 114), 'ё': (0.0, 0),
                                                 'ж': (0.003394014193150262, 11), 'з': (0.007096575131132366, 23),
                                                 'и': (0.04103671706263499, 114),
                                                 'й': (0.0064794816414686825, 20), 'к': (0.016044430731255787, 48),
                                                 'л': (0.0330145016970071, 98),
                                                 'м': (0.021906818883060782, 69), 'н': (0.030854674483184203, 83),
                                                 'о': (0.06201789571120025, 149),
                                                 'п': (0.012650416538105523, 40), 'р': (0.02406664609688368, 71),
                                                 'с': (0.029003394014193152, 80),
                                                 'т': (0.032397408207343416, 89), 'у': (0.01635297747608763, 48),
                                                 'ф': (0.0030854674483184203, 9),
                                                 'х': (0.002776920703486578, 9), 'ц': (0.002468373958654736, 8),
                                                 'ч': (0.008947855600123419, 26),
                                                 'ш': (0.0037025609379821045, 11), 'щ': (0.002776920703486578, 9),
                                                 'ъ': (0.0, 0), 'ы': (0.01573588398642394, 43),
                                                 'ь': (0.013267510027769207, 42), 'э': (0.0030854674483184203, 10),
                                                 'ю': (0.005245294662141314, 17),
                                                 'я': (0.007713668620796051, 23), 'a': (0.04103671706263499, 126),
                                                 'b': (0.0046282011724776305, 15),
                                                 'c': (0.013267510027769207, 38), 'd': (0.029003394014193152, 72),
                                                 'e': (0.0484418389385992, 126),
                                                 'f': (0.01511879049676026, 37), 'g': (0.008022215365627893, 26),
                                                 'h': (0.02283245911755631, 73),
                                                 'i': (0.023141005862388153, 69), 'j': (0.0015427337241592102, 5),
                                                 'k': (0.0015427337241592102, 5),
                                                 'l': (0.02437519284171552, 67), 'm': (0.009873495834618945, 32),
                                                 'n': (0.029003394014193152, 89),
                                                 'o': (0.02591792656587473, 79), 'p': (0.007713668620796051, 22),
                                                 'q': (0.0021598272138228943, 7),
                                                 'r': (0.018512804689910522, 55), 's': (0.03332304844183894, 87),
                                                 't': (0.04165381055229867, 123),
                                                 'u': (0.016044430731255787, 51), 'v': (0.0046282011724776305, 15),
                                                 'w': (0.007713668620796051, 25),
                                                 'x': (0.000617093489663684, 2), 'y': (0.009564949089787103, 31),
                                                 'z': (0.000308546744831842, 1)}

resulting_statistics_for_mixed_text = {
    'word_amount': 615, 'а': (0.04165381055229867, 105), 'б': (0.007713668620796051, 25),
    'в': (0.03332304844183894, 85), 'г': (0.012341869793273681, 37), 'д': (0.011724776303609998, 38),
    'е': (0.04813329219376736, 114), 'ё': (0.0, 0), 'ж': (0.003394014193150262, 11), 'з': (0.007096575131132366, 23),
    'и': (0.04103671706263499, 114), 'й': (0.0064794816414686825, 20), 'к': (0.016044430731255787, 48),
    'л': (0.0330145016970071, 98), 'м': (0.021906818883060782, 69), 'н': (0.030854674483184203, 83),
    'о': (0.06201789571120025, 149), 'п': (0.012650416538105523, 40), 'р': (0.02406664609688368, 71),
    'с': (0.029003394014193152, 80), 'т': (0.032397408207343416, 89), 'у': (0.01635297747608763, 48),
    'ф': (0.0030854674483184203, 9), 'х': (0.002776920703486578, 9), 'ц': (0.002468373958654736, 8),
    'ч': (0.008947855600123419, 26), 'ш': (0.0037025609379821045, 11), 'щ': (0.002776920703486578, 9),
    'ъ': (0.0, 0), 'ы': (0.01573588398642394, 43), 'ь': (0.013267510027769207, 42), 'э': (0.0030854674483184203, 10),
    'ю': (0.005245294662141314, 17), 'я': (0.007713668620796051, 23), 'a': (0.04103671706263499, 126),
    'b': (0.0046282011724776305, 15), 'c': (0.013267510027769207, 38), 'd': (0.029003394014193152, 72),
    'e': (0.0484418389385992, 126), 'f': (0.01511879049676026, 37), 'g': (0.008022215365627893, 26),
    'h': (0.02283245911755631, 73), 'i': (0.023141005862388153, 69), 'j': (0.0015427337241592102, 5),
    'k': (0.0015427337241592102, 5), 'l': (0.02437519284171552, 67), 'm': (0.009873495834618945, 32),
    'n': (0.029003394014193152, 89), 'o': (0.02591792656587473, 79), 'p': (0.007713668620796051, 22),
    'q': (0.0021598272138228943, 7), 'r': (0.018512804689910522, 55), 's': (0.03332304844183894, 87),
    't': (0.04165381055229867, 123), 'u': (0.016044430731255787, 51), 'v': (0.0046282011724776305, 15),
    'w': (0.007713668620796051, 25), 'x': (0.000617093489663684, 2), 'y': (0.009564949089787103, 31),
    'z': (0.000308546744831842, 1), 'paragraph_amount': 37, 'bilingual_word_amount': 10
}
